//12main11_1
//Взаимодействие с пользователем

//ф-я alert-(всплывающие окно)принимает 1 пар-тр,который будет выводиться в окне

// var numbers = 45;
// alert("Переменная: " + numbers);
// alert();

//ф-я prompt - можно ввести какие-либо данные
//1й пар-тр - это заголовок,2й -знач. по умолчанию

// let getUserInfo = prompt("Сколько вам лет?",18);
// alert("Переменная: " + getUserInfo);

//ф-я confirm - вызывает окно с вопросом

let isConfirm = confirm("Согласны ли вы на обработку данных?");
alert(isConfirm);